#include<stdio.h> 
#include<math.h>
int main()
{

	int ch[3][14]={{27000,27000,28000,28000,28000,28000,28000,28000,28000,28000,28000,27000,27000,26000},
				{9000,10000,11000,11000,11000,11000,10500,10200,10000,9900,9800,9800,9500,9000},
				{5500,5500,5500,5500,6000,6000,6000,6000,6000,6000,5500,5500,5500,5500}};
	int s[3]={4,9,15};
	int a,b,c,d,e,f,i,qi[3][2]={{4800,720000},{12600,378000},{37500,135000}};
	float  z[3]={0.05,0.08,0.11},ga[2][3]={{0.5,0.3,0.2},{0.4,0.3,0.3}};
	float  y[3]={0.1,0.23,0.35}; 
	float  yb[3]={0.025,0.015,0.0025};
	float  l[3]={0.05,0.20,0.38};
	float  lb[3]={0.03,0.015,0};
	float q[3]={0.015,0.09,0.1};
	double la,yu,zu,ci,co,cii,npv,npv1;	
//	FILE *fp;
//	fp=fopen("g:\\1.txt","w");
	for(b=0;b<3;b++)											//折现率 
	{	
	printf("折现率为%f时\n",z[b]);
		for(a=0;a<3;a++)										//方案 
		{
			ci=0;
			printf("  第%d方案\n",a);
			cii=0;
			npv=0;
			for(c=0;c<16;c++)									//年份 
			{		
				f=2000/ch[a][c];
				if(2000%ch[a][c]==0)
					f++;
				printf("    第%2d年的净现值为",c+1);
				i=0;
				if(c<=1)
				npv=(0-qi[a][c])*pow(1+z[b],-c)+npv;				
				else
				{		
					for(d=0;d<3;d++)							//劳动率 
					{
						la=pow(lb[d]+1,c-2)*l[a];
						for(e=0;e<3;e++)						//原材料
						{
								yu=pow(yb[e]+1,c-2)*y[a];
									co=ch[a][c-2]*(la+yu+q[a]);
									npv=ga[0][d]*ga[1][e]*(ci-co)*pow(1+z[b],-c)+npv;	
									i++;											
						}							
					}
					cii=ch[a][c-2]*(s[a]-f)*0.3+cii;
					ci=cii+20000*5;				
				}	
				printf("%lf\n",npv);
			//	fprintf(fp,"%lf ",npv);
				//fclose(fp);
			}
		//fprintf(fp,"\n");
		}
	} 
}
